const quizDataJp = [
  // {
  //   check: 'G1_kamei',
  //   question: 'この問題の答えはなんでしょう',
  //   a: 'Take My Hand',
  //   b: 'When The Sun Goes Down',
  //   c: 'Song 2',
  //   d: 'Rewind',
  //   explanation: 'この問題の答えはCです',
  // },

  //学年 科目(dataで分ける？) 単元ごと(理系科目)
  //2学期末までに戻るボタン実装
  
  ////// 中１

  //// 中１ 亀井

  // 中１ 亀井 英語

  // 中１ 亀井 数学

  // 中１ 亀井 理科

  // 中１ 亀井 社会


  //// 中１ 龍華

  // 中１ 龍華 英語

  // 中１ 龍華 数学

  // 中１ 龍華 理科

  {
    check: 'G1_ryuge_SI',
    question: '電球や太陽のように自ら光を出すものを何というか。',
    a: '光源',
    b: '光元',
    c: '音源',
    d: '発音体',
    explanation: '',
  },
  {
    check: 'G1_ryuge_SI',
    question: '光の性質として適切でないものはどれか。',
    a: '焦点',
    b: '直進',
    c: '反射',
    d: '屈折',
    explanation: '光は直進(まっすぐ進むこと)・反射(鏡などの表面にあたってはね返ること)・屈折(異なる種類の物質の中にななめに入るとき、その境界面で光が折れ曲がること)の性質を持っています。',
  },
  {
    check: 'G1_ryuge_SI',
    question: '反射の法則において成り立つものはどれか。',
    a: '入射角＝反射角',
    b: '入射角＞反射角',
    c: '入射角＜反射角',
    d: '屈折角＝反射角',
    explanation: '入射角＝反射角となることを反射の法則といいます。',
  },
  {
    check: 'G1_ryuge_SI',
    question: '光が空気中から水中に侵入し、屈折するときに成り立つものはどれか。',
    a: '入射角＞屈折角',
    b: '入射角＜屈折角',
    c: '入射角＝屈折角',
    d: '入射角≦屈折角',
    explanation: '水中から空気中にでるときには入射角＜屈折角となります。',
  },
  {
    check: 'G1_ryuge_SI',
    question: '光がガラス中や水中から空気中に進むとき、入射角をある大きさ以上にすると、光が空気中に出なくなる。この現象を何というか。',
    a: '全反射',
    b: '反射の法則',
    c: '光の直進',
    d: '乱反射',
    explanation: '選択肢にある「乱反射」は、でこぼこした面で、光がさまざまな方向に反射することをいいます。',
  },
  {
    check: 'G1_ryuge_SI',
    question: '凸レンズの光軸に平行な光を当てたとき、凸レンズで屈折した光が集まる点を何というか。',
    a: '焦点',
    b: '屈折点',
    c: '反射点',
    d: 'レンズ点',
    explanation: '凸レンズの中心から焦点までの距離を焦点距離といいます。',
  },
  {
    check: 'G1_ryuge_SI',
    question: '物体が凸レンズの焦点の外側にあるとき、光が実際に集まってできる像を何というか。',
    a: '倒立実像',
    b: '正立実像',
    c: '倒立虚像',
    d: '正立虚像',
    explanation: '実際に光が集まって見えるものを実像、実際に光は集まっていないが、凸レンズを通して見えるものを虚像といいます。',
  },
  {
    check: 'G1_ryuge_SI',
    question: '凸レンズにおいて、物体が焦点距離の２倍の位置にあるとき、できる像の大きさは元の物体と比べてどうなるか。',
    a: '同じ大きさ',
    b: '大きくなる',
    c: '小さくなる',
    d: '像はできない',
    explanation: '焦点距離の２倍の位置に物体を置いたとき、左右上下逆で、元の物体と同じ大きさの実像ができます。',
  },
  {
    check: 'G1_ryuge_SI',
    question: '凸レンズにおいて、虚像ができるとき、その大きさは元の物体と比べてどうなるか。',
    a: '大きくなる',
    b: '同じ大きさ',
    c: '小さくなる',
    d: '像はできない。',
    explanation: '虚像ができる場合は必ず、左右上下そのままで、元の物体よりも大きい像ができます。',
  },
  {
    check: 'G1_ryuge_SI',
    question: '凸レンズにおいて、物体を焦点の位置に置いたときその像の大きさは元の物体と比べてどうなるか。',
    a: '像はできない',
    b: '同じ大きさ',
    c: '大きくなる',
    d: '小さくなる',
    explanation: '焦点の位置に物体を置くと、凸レンズの中心を通る光と、凸レンズで屈折して焦点を通る光が平行になり、交わらなくなるので像はできません。',
  },

  // 中１ 龍華 社会

  //// 中１ 大正

  // 中１ 大正 英語

  // 中１ 大正 数学

  // 中１ 大正 理科

  // 中１ 大正 社会

  //// 中１ 曙南

  // 中１ 曙南 英語

  // 中１ 曙南 数学

  // 中１ 曙南 理科

  // 中１ 曙南 社会

  //// 中１ 長六

  // 中１ 長六 英語

  // 中１ 長六 数学

  // 中１ 長六 理科

  // 中１ 長六 社会

  ////// 中２

  //// 中２ 亀井

  // 中２ 亀井 英語

  // 中２ 亀井 数学

  // 中２ 亀井 理科

  // 中２ 亀井 社会

  //// 中２ 龍華

  // 中２ 龍華 英語

  // 中２ 龍華 数学

  // 中２ 龍華 理科
  {
  check: 'G2_ryuge_SI',
  question: '電流が電源の＋極から－極に流れる道筋のことを何というか。',
  a: '回路',
  b: '導体',
  c: '不導体',
  d: '絶縁体',
  explanation: '',
},
{
  check: 'G2_ryuge_SI',
  question: '電流の道筋に分かれ道がない回路を何というか。',
  a: '直列回路',
  b: '並列回路',
  c: '電流回路',
  d: '電圧回路',
  explanation: '分かれ道のない回路を「直列回路」、分かれ道がある回路を「並列回路」といいます。',
},
{
  check: 'G2_ryuge_SI',
  question: '抵抗にかかる電圧を測りたいとき、電圧計はどのようにつなげばよいか。',
  a: '測りたい抵抗に並列につなぐ',
  b: '測りたい抵抗に直列につなぐ',
  c: '電池に対して並列につなぐ',
  d: '電池に対して直列につばぐ',
  explanation: '電圧計は測りたい部分に並列につなぎ、電流計は測りたい部分に直列につなぎます。',
},
{
  check: 'G2_ryuge_SI',
  question: 'R₁［Ω］の抵抗とR₂［Ω］の抵抗を直列につなぎました。合成抵抗はいくらか。',
  a: 'R₁＋R₂［Ω］',　
  b: 'R₁×R₂［Ω］',
  c: '1/R₁＋1/R₂［Ω］',
  d: '(R₁×R₂)/(R₁＋R₂)',
  explanation: '直列回路の合成抵抗は各抵抗の値の和と等しく、並列回路の合成抵抗は各抵抗の値よりも小さくなります。',
},
{
  check: 'G2_ryuge_SI',
  question: '物体に流れる電流が、加わる電圧に比例する関係を何というか。',
  a: 'オームの法則',
  b: 'フックの法則',
  c: '質量保存の法則',
  d: '比例の法則',
  explanation: 'オームの法則は今回のテスト範囲の最重要事項です。しっかり覚えましょう。',
},
{
  check: 'G2_ryuge_SI',
  question: '電流をＡ、電圧をＶ、抵抗をΩとしたとき、オームの法則において、次のうち適切でないものはどれか。',
  a: 'Ａ＝Ω×Ｖ',
  b: 'Ｖ＝Ａ×Ω',
  c: 'Ａ＝Ｖ÷Ω',
  d: 'Ω＝Ｖ÷Ａ',
  explanation: '覚えにくい人は、授業で解説した通り、仮面ライダーか、タコ・イカ・カモメで覚えましょう。',
},
{
  check: 'G2_ryuge_SI',
  question: '2Ｖの電池に4Ωの抵抗をつなぎました。このときの電流はいくらか。',
  a: '0.5Ａ',
  b: '2Ａ',
  c: '8Ａ',
  d: '0.2Ａ',
  explanation: '2[Ｖ]÷4[Ω]＝0.5Ａ\n理科の答えを書くときは分数ではなく小数で書くことに気をつけましょう。',
},
{
  check: 'G2_ryuge_SI',
  question: '12Ｖの電池に4Ωの抵抗と2Ωの抵抗を直列につないだとき、電池に流れる電流はいくらか。',
  a: '2A',
  b: '3A',
  c: '6A',
  d: '0.5A',
  explanation: '直列回路なので、合成抵抗は4[Ω]＋2[Ω]＝6[Ω]\よって、求める電流は12[V]÷6[Ω]＝2[A]',
},
{
  check: 'G2_ryuge_SI',
  question: '電気器具は、熱や光、音などを出したり、物体を動かしたりする能力がある。電気がもつこのような能力を何というか。',
  a: '電気エネルギー',
  b: '電気量',
  c: '電力',
  d: '電気力',
  explanation: '',
},
{
  check: 'G2_ryuge_SI',
  question: '電力[Ｗ]、電圧[Ｖ]、電流[Ａ]、抵抗[Ω]について、適切な関係を示すものは次のうちどれか。',
  a: 'Ｗ＝Ｖ×Ａ',
  b: 'Ｗ＝Ｖ×Ω',
  c: 'Ｗ＝Ａ×Ω',
  d: 'Ｗ＝Ｖ÷Ａ',
  explanation: '',
},
{
  check: 'G2_ryuge_SI',
  question: '熱量[Ｊ]、時間(秒)[s]、電力[Ｗ]、電圧[Ｖ]、電流[Ａ]、抵抗[Ω]について、適切な関係を示すものは次のうちどれか。',
  a: 'Ｊ＝Ｗ×ｓ',
  b: 'Ｊ＝Ｖ×Ａ',
  c: 'Ｊ＝Ｖ×ｓ',
  d: 'Ｊ＝Ｗ÷ｓ',
  explanation: 'ｓは「秒」です。問題では「分」などの数値が与えられることが多いので、秒になおすことを忘れないように気をつけましょう。',
},

  // 中２ 龍華 社会
  
  //// 中２ 大正

  // 中２ 大正 英語

  // 中２ 大正 数学

  // 中２ 大正 理科

  // 中２ 大正 社会

  //// 中２ 曙南

  // 中２ 曙南 英語

  // 中２ 曙南 数学

  // 中２ 曙南 理科

  // 中２ 曙南 社会

  //// 中２ 長六

  // 中２ 長六 英語

  // 中２ 長六 数学

  // 中２ 長六 理科

  // 中２ 長六 社会


  ////// 中３

  //// 中３ 亀井

  // 中３ 亀井 英語

  // 中３ 亀井 数学

  // 中３ 亀井 理科

  // 中３ 亀井 社会

  //// 中３ 龍華

  // 中３ 龍華 英語

  // 中３ 龍華 数学

  // 中３ 龍華 理科
  {
    check: 'G3_ryuge_SI',
    question: '明けの明星と呼ばれる天体が見えるのはいつか。',
    a: '日の出直前',
    b: '日の入り直後',
    c: '真夜中',
    d: 'お昼',
    explanation: '金星は特定の時間にとても明るく見えるため「明星」と呼ばれます。\n明け方に見える金星を「明けの明星」、夕方に見える金星を「よいの明星」といいます。',
  },
  {
    check: 'G3_ryuge_SI',
    question: '金星が明け方に見えるとき、その方角はどちらか。',
    a: '東',
    b: '西',
    c: '北',
    d: '南',
    explanation: '明けの明星は明け方東に、よいの明星は夕方西にみえます。',
  },
  {    
    check: 'G3_ryuge_SI',
    question: '金星の見かけの大きさが変化するのは、金星と何との距離が変化するためか。',
    a: '地球',
    b: '太陽',
    c: '月',
    d: '北極星',
    explanation: '地球から遠くなれば見かけの大きさは小さく、地球に近くなれば見かけの大きさは大きくなります。',
  },
  {    
    check: 'G3_ryuge_SI',
    question: '月の公転周期として正しいものはどれか。',
    a: '27.3日',
    b: '29.5日',
    c: '30日',
    d: '23.4日',
    explanation: '月の公転周期は27.3日。月の自転周期も27.3日です。\nこのように自転周期と公転周期は等しいため、月は地球から見たときに同じ面しか見えなくなります。',
  },
  {
    check: 'G3_ryuge_SI',
    question: '毎日同じ時刻に月を観察すると、どちらからどちらの方角へ移動しているように見えるか。',
    a: '西から東',
    b: '東から西',
    c: '南から北',
    d: '北から南',
    explanation: '月の公転によりこのように見えます。',
  },
  {    
    check: 'G3_ryuge_SI',
    question: '日食が起こるときの並び方として正しいものはどれか。',
    a: '太陽－月－地球',
    b: '太陽－地球－月',
    c: '地球－太陽－月',
    d: '月－太陽－地球',
    explanation: '太陽が月によって隠されることを日食、地球の影によって月が隠されることを月食といいます。',
  },
  {    
    check: 'G3_ryuge_SI',
    question: '傾きが90°の斜面をボールが転がるときの運動のことを何というか。',
    a: '自由落下',
    b: '等速直線運動',
    c: '慣性',
    d: '反作用',
    explanation: '傾きが90°のとき、垂直抗力ははたらかず、重力だけがはたらくため自由落下と同じ状態になります。\nまた自由落下は落下運動ともいいます。',
  },
  {    
    check: 'G3_ryuge_SI',
    question: '運動している物体に対して、何も力がはたらいていないとき、その物体はどのような運動をするか。',
    a: '等速直線運動',
    b: '自由落下',
    c: '静止',
    d: '等加速度運動',
    explanation: '',
  },
  {    
    check: 'G3_ryuge_SI',
    question: '１秒間に60打点する記録タイマーがある。この記録タイマーが6打点するのにかかる時間は次のうちどれか。',
    a: '0.1秒',
    b: '1秒',
    c: '0.01秒',
    d: '1/60秒',
    explanation: 'いつもの理科の計算(比例計算)をしましょう。１秒→60回、□秒→6回',
  },
  {    
    check: 'G3_ryuge_SI',
    question: '水の重さによって生じる圧力を何というか。',
    a: '浮力',
    b: '気圧',
    c: '水圧',
    d: '張力',
    explanation: 'この問題の解説\n水圧は深さに比例します。',
  },
  {  
    check: 'G3_ryuge_SI',
    question: '水中にある物体が水から受ける上向きの力を何というか。',
    a: '浮力',
    b: '張力',
    c: '弾性力',
    d: '摩擦力',
    explanation: 'この問題の解説\n浮力は、深さの違いによって生まれる水圧の差によって生じます。',
  },
  {
    check: 'G3_ryuge_SI',
    question: '１つの物体にはたらく２力を、それと同じはたらきをする１つの力に置き換えることを『力の〇〇』という。',
    a: '分解',
    b: '合成',
    c: '屈折',
    d: '反射',
    explanation: '',
  },
  {    
    check: 'G3_ryuge_SI',
    question: '一直線上で同じ向きにはたらく２力の合力の大きさは、２力の大きさの何と等しくなるか。',
    a: '和',
    b: '差',
    c: '積',
    d: '商',
    explanation: '',
  },
  {    
    check: 'G3_ryuge_SI',
    question: '一直線上で反対向きにはたらく２力の合力の大きさは、２力の大きさの何と等しくなるか。',
    a: '和',
    b: '差',
    c: '積',
    d: '商',
    explanation: '',
  },
  {
    check: 'G3_ryuge_SI',
    question: '角度をもった２力の合力は、２力を２辺とする何という図形の対角線で表されるか。',
    a: '三角形',
    b: '台形',
    c: '正方形',
    d: '平行四辺形',
    explanation: 'この問題の解説\nこのように合力が示されることを力の平行四辺形の法則といいます。',
  },
  {
    check: 'G3_ryuge_SI',
    question: '1秒間に60打点する記録タイマーは、何秒ごとに打点するか。',
    a: '1/60秒',
    b: '1/50秒',
    c: '1/70秒',
    d: '1/40秒',
    explanation: 'この問題の解説\n記録タイマーは、西日本では1秒間に60打点、東日本では1秒間に50打点します。',
  },
  {    
    check: 'G3_ryuge_SI',
    question: '物体が一定の速さで移動したと考えて求めた速さを何というか。',
    a: '瞬間の速さ',
    b: '平均の速さ',
    c: '合計の速さ',
    d: '１時間の速さ',
    explanation: 'この問題の解説\nこれに対し、ごく短い時間に移動した距離をもとに求める速さを『瞬間の速さ』といいます。',
  }    
  // 中３ 龍華 社会

  //// 中３ 大正

  // 中３ 大正 英語

  // 中３ 大正 数学

  // 中３ 大正 理科

  // 中３ 大正 社会

  //// 中３ 曙南

  // 中３ 曙南 英語

  // 中３ 曙南 数学

  // 中３ 曙南 理科

  // 中３ 曙南 社会

  //// 中３ 長六

  // 中３ 長六 英語

  // 中３ 長六 数学

  // 中３ 長六 理科

  // 中３ 長六 社会



];

export { quizDataJp }