const quizDataJp = [
  // {
  //   check: 'G1_kamei',
  //   question: 'この問題の答えはなんでしょう',
  //   a: 'Take My Hand',
  //   b: 'When The Sun Goes Down',
  //   c: 'Song 2',
  //   d: 'Rewind',
  //   explanation: 'この問題の答えはCです',
  // },

  //学年 科目(dataで分ける？) 単元ごと(理系科目)
  //2学期末までに戻るボタン実装
  
  ////// 中１

  //// 中１ 亀井

  // 中１ 亀井 英語

  // 中１ 亀井 数学

  // 中１ 亀井 理科

  // 中１ 亀井 社会


  //// 中１ 龍華

  // 中１ 龍華 英語

  // 中１ 龍華 数学

  // 中１ 龍華 理科

  {
    check: 'G1_ryuge_SI',
    question: '電球や太陽のように自ら光を出すものを何というか。',
    a: '光源',
    b: '光元',
    c: '音源',
    d: '発音体',
    explanation: '',
  },
  {
    check: 'G1_ryuge_SI',
    question: '光の性質として適切でないものはどれか。',
    a: '焦点',
    b: '直進',
    c: '反射',
    d: '屈折',
    explanation: '光は直進(まっすぐ進むこと)・反射(鏡などの表面にあたってはね返ること)・屈折(異なる種類の物質の中にななめに入るとき、その境界面で光が折れ曲がること)の性質を持っています。',
  },
  {
    check: 'G1_ryuge_SI',
    question: '反射の法則において成り立つものはどれか。',
    a: '入射角＝反射角',
    b: '入射角＞反射角',
    c: '入射角＜反射角',
    d: '屈折角＝反射角',
    explanation: '入射角＝反射角となることを反射の法則といいます。',
  },
  {
    check: 'G1_ryuge_SI',
    question: '光が空気中から水中に侵入し、屈折するときに成り立つものはどれか。',
    a: '入射角＞屈折角',
    b: '入射角＜屈折角',
    c: '入射角＝屈折角',
    d: '入射角≦屈折角',
    explanation: '水中から空気中にでるときには入射角＜屈折角となります。',
  },
  {
    check: 'G1_ryuge_SI',
    question: '光がガラス中や水中から空気中に進むとき、入射角をある大きさ以上にすると、光が空気中に出なくなる。この現象を何というか。',
    a: '全反射',
    b: '反射の法則',
    c: '光の直進',
    d: '乱反射',
    explanation: '選択肢にある「乱反射」は、でこぼこした面で、光がさまざまな方向に反射することをいいます。',
  },
  {
    check: 'G1_ryuge_SI',
    question: '凸レンズの光軸に平行な光を当てたとき、凸レンズで屈折した光が集まる点を何というか。',
    a: '焦点',
    b: '屈折点',
    c: '反射点',
    d: 'レンズ点',
    explanation: '凸レンズの中心から焦点までの距離を焦点距離といいます。',
  },
  {
    check: 'G1_ryuge_SI',
    question: '物体が凸レンズの焦点の外側にあるとき、光が実際に集まってできる像を何というか。',
    a: '倒立実像',
    b: '正立実像',
    c: '倒立虚像',
    d: '正立虚像',
    explanation: '実際に光が集まって見えるものを実像、実際に光は集まっていないが、凸レンズを通して見えるものを虚像といいます。',
  },
  {
    check: 'G1_ryuge_SI',
    question: '凸レンズにおいて、物体が焦点距離の２倍の位置にあるとき、できる像の大きさは元の物体と比べてどうなるか。',
    a: '同じ大きさ',
    b: '大きくなる',
    c: '小さくなる',
    d: '像はできない',
    explanation: '焦点距離の２倍の位置に物体を置いたとき、左右上下逆で、元の物体と同じ大きさの実像ができます。',
  },
  {
    check: 'G1_ryuge_SI',
    question: '凸レンズにおいて、虚像ができるとき、その大きさは元の物体と比べてどうなるか。',
    a: '大きくなる',
    b: '同じ大きさ',
    c: '小さくなる',
    d: '像はできない。',
    explanation: '虚像ができる場合は必ず、左右上下そのままで、元の物体よりも大きい像ができます。',
  },
  {
    check: 'G1_ryuge_SI',
    question: '凸レンズにおいて、物体を焦点の位置に置いたときその像の大きさは元の物体と比べてどうなるか。',
    a: '像はできない',
    b: '同じ大きさ',
    c: '大きくなる',
    d: '小さくなる',
    explanation: '焦点の位置に物体を置くと、凸レンズの中心を通る光と、凸レンズで屈折して焦点を通る光が平行になり、交わらなくなるので像はできません。',
  },

  // 中１ 龍華 社会

  //// 中１ 大正

  // 中１ 大正 英語

  // 中１ 大正 数学

  // 中１ 大正 理科

  // 中１ 大正 社会

  //// 中１ 曙南

  // 中１ 曙南 英語

  // 中１ 曙南 数学

  // 中１ 曙南 理科

  // 中１ 曙南 社会

  //// 中１ 長六

  // 中１ 長六 英語

  // 中１ 長六 数学

  // 中１ 長六 理科

  // 中１ 長六 社会

  ////// 中２

  //// 中２ 亀井

  // 中２ 亀井 英語

  // 中２ 亀井 数学

  // 中２ 亀井 理科

  // 中２ 亀井 社会

  //// 中２ 龍華

  // 中２ 龍華 英語

  // 中２ 龍華 数学

  // 中２ 龍華 理科
  {
  check: 'G2_ryuge_SI',
  question: '電流が電源の＋極から－極に流れる道筋のことを何というか。',
  a: '回路',
  b: '導体',
  c: '不導体',
  d: '絶縁体',
  explanation: '',
},
{
  check: 'G2_ryuge_SI',
  question: '電流の道筋に分かれ道がない回路を何というか。',
  a: '直列回路',
  b: '並列回路',
  c: '電流回路',
  d: '電圧回路',
  explanation: '分かれ道のない回路を「直列回路」、分かれ道がある回路を「並列回路」といいます。',
},
{
  check: 'G2_ryuge_SI',
  question: '抵抗にかかる電圧を測りたいとき、電圧計はどのようにつなげばよいか。',
  a: '測りたい抵抗に並列につなぐ',
  b: '測りたい抵抗に直列につなぐ',
  c: '電池に対して並列につなぐ',
  d: '電池に対して直列につばぐ',
  explanation: '電圧計は測りたい部分に並列につなぎ、電流計は測りたい部分に直列につなぎます。',
},
{
  check: 'G2_ryuge_SI',
  question: 'R₁［Ω］の抵抗とR₂［Ω］の抵抗を直列につなぎました。合成抵抗はいくらか。',
  a: 'R₁＋R₂［Ω］',　
  b: 'R₁×R₂［Ω］',
  c: '1/R₁＋1/R₂［Ω］',
  d: '(R₁×R₂)/(R₁＋R₂)',
  explanation: '直列回路の合成抵抗は各抵抗の値の和と等しく、並列回路の合成抵抗は各抵抗の値よりも小さくなります。',
},
{
  check: 'G2_ryuge_SI',
  question: '物体に流れる電流が、加わる電圧に比例する関係を何というか。',
  a: 'オームの法則',
  b: 'フックの法則',
  c: '質量保存の法則',
  d: '比例の法則',
  explanation: 'オームの法則は今回のテスト範囲の最重要事項です。しっかり覚えましょう。',
},
{
  check: 'G2_ryuge_SI',
  question: '電流をＡ、電圧をＶ、抵抗をΩとしたとき、オームの法則において、次のうち適切でないものはどれか。',
  a: 'Ａ＝Ω×Ｖ',
  b: 'Ｖ＝Ａ×Ω',
  c: 'Ａ＝Ｖ÷Ω',
  d: 'Ω＝Ｖ÷Ａ',
  explanation: '覚えにくい人は、授業で解説した通り、仮面ライダーか、タコ・イカ・カモメで覚えましょう。',
},
{
  check: 'G2_ryuge_SI',
  question: '2Ｖの電池に4Ωの抵抗をつなぎました。このときの電流はいくらか。',
  a: '0.5Ａ',
  b: '2Ａ',
  c: '8Ａ',
  d: '0.2Ａ',
  explanation: '2[Ｖ]÷4[Ω]＝0.5Ａ\n理科の答えを書くときは分数ではなく小数で書くことに気をつけましょう。',
},
{
  check: 'G2_ryuge_SI',
  question: '12Ｖの電池に4Ωの抵抗と2Ωの抵抗を直列につないだとき、電池に流れる電流はいくらか。',
  a: '2A',
  b: '3A',
  c: '6A',
  d: '0.5A',
  explanation: '直列回路なので、合成抵抗は4[Ω]＋2[Ω]＝6[Ω]\よって、求める電流は12[V]÷6[Ω]＝2[A]',
},
{
  check: 'G2_ryuge_SI',
  question: '電気器具は、熱や光、音などを出したり、物体を動かしたりする能力がある。電気がもつこのような能力を何というか。',
  a: '電気エネルギー',
  b: '電気量',
  c: '電力',
  d: '電気力',
  explanation: '',
},
{
  check: 'G2_ryuge_SI',
  question: '電力[Ｗ]、電圧[Ｖ]、電流[Ａ]、抵抗[Ω]について、適切な関係を示すものは次のうちどれか。',
  a: 'Ｗ＝Ｖ×Ａ',
  b: 'Ｗ＝Ｖ×Ω',
  c: 'Ｗ＝Ａ×Ω',
  d: 'Ｗ＝Ｖ÷Ａ',
  explanation: '',
},
{
  check: 'G2_ryuge_SI',
  question: '熱量[Ｊ]、時間(秒)[s]、電力[Ｗ]、電圧[Ｖ]、電流[Ａ]、抵抗[Ω]について、適切な関係を示すものは次のうちどれか。',
  a: 'Ｊ＝Ｗ×ｓ',
  b: 'Ｊ＝Ｖ×Ａ',
  c: 'Ｊ＝Ｖ×ｓ',
  d: 'Ｊ＝Ｗ÷ｓ',
  explanation: 'ｓは「秒」です。問題では「分」などの数値が与えられることが多いので、秒になおすことを忘れないように気をつけましょう。',
},

  // 中２ 龍華 社会
  
  //// 中２ 大正

  // 中２ 大正 英語

  // 中２ 大正 数学

  // 中２ 大正 理科

  // 中２ 大正 社会

  //// 中２ 曙南

  // 中２ 曙南 英語

  // 中２ 曙南 数学

  // 中２ 曙南 理科

  // 中２ 曙南 社会

  //// 中２ 長六

  // 中２ 長六 英語

  // 中２ 長六 数学

  // 中２ 長六 理科

  // 中２ 長六 社会


  ////// 中３

  //// 中３ 亀井

  // 中３ 亀井 英語

  // 中３ 亀井 数学

  // 中３ 亀井 理科

  // 中３ 亀井 社会

  //// 中３ 龍華

  // 中３ 龍華 英語

  // 中３ 龍華 数学

  // 中３ 龍華 理科
  {
    check: 'G3_ryuge_SI',
    question: '酸とアルカリが互いの性質を打ち消しあうような反応を何というか。',
    a: '中和反応',
    b: '吸熱反応',
    c: '化学反応',
    d: '中性反応',
    explanation: '',
  },
  {
    check: 'G3_ryuge_SI',
    question: 'すべての中和反応で発生するものにおいて適当でないものは次のうちどれ。',
    a: '塩化ナトリウム',
    b: '塩',
    c: '水',
    d: '熱',
    explanation: 'この問題の解説\n中和反応では、水と塩(えん)、さらに熱も発生します。',
  },
  {
    check: 'G3_ryuge_SI',
    question: '次のうち酸性を示す物質はどれ。',
    a: '硫酸',
    b: '水酸化ナトリウム',
    c: '炭酸水素ナトリウム',
    d: '塩化ナトリウム',
    explanation: 'この問題の解説\n〇〇酸となるものは酸性を示します。',
    correct: 'd'
  },
  {
    check: 'G3_ryuge_SI',
    question: '次のうちアルカリ性を示す物質はどれ。',
    a: '水酸化ナトリウム',
    b: '塩化ナトリウム',
    c: '硫酸',
    d: '酢酸',
    explanation: 'この問題の解説\n水酸化〇〇となるものはアルカリ性を示しますが、アルカリ性の物質の中にはアンモニア水のように『水酸化』がつかない物質もあります。',
  },
  {
    check: 'G3_ryuge_SI',
    question: '次のうち、酸性を示すイオンはどれ。',
    a: '水素イオン',
    b: '水酸化物イオン',
    c: '塩化物イオン',
    d: '硫酸イオン',
    explanation: 'この問題の解説\n酸性の物質が電離すると水素イオンが発生します。',
  },
  {
    check: 'G3_ryuge_SI',
    question: '次のうちアルカリ性を示すイオンはどれ。',
    a: '水酸化物イオン',
    b: '水素イオン',
    c: '塩化物イオン',
    d: 'ナトリウムイオン',
    explanation: 'この問題の解説\nアルカリ性の物質が電離すると水酸化物イオンが発生します。',
  },
  {
    check: 'G3_ryuge_SI',
    question: '中性を示すpHは次のうちどれ。',
    a: '7',
    b: '6',
    c: '0',
    d: '14',
    explanation: 'この問題の解説\npHは0～14で小さくなるほど強い酸性を示し、大きくなるほど強いアルカリ性を示します。',
  },
  {
    check: 'G3_ryuge_SI',
    question: 'BTB溶液に塩酸を滴下したとき、溶液は何色になるか。',
    a: '黄色',
    b: '青色',
    c: '緑色',
    d: '赤色',
    explanation: 'この問題の解説\nBTB溶液は酸性で黄色、中性で緑色、アルカリ性で青色を示します。',
  },
  {
    check: 'G3_ryuge_SI',
    question: '塩化銅水溶液を電気分解するとき、陽極のほうへ移動するイオンはどれ。',
    a: '塩化物イオン',
    b: '銅イオン',
    c: '水素イオン',
    d: '水酸化物イオン',
    explanation: 'この問題の解説\n電気分解をすると陽極に陰イオンが、陰極に陽イオンが移動します。',
  },
  {
    check: 'G3_ryuge_SI',
    question: '塩酸と水酸化ナトリウム水溶液の中和でできる塩はどれ。',
    a: '塩化ナトリウム',
    b: '水',
    c: '硝酸ナトリウム',
    d: '硫酸バリウム',
    explanation: '',
  },
  {
    check: 'G3_ryuge_SI',
    question: '次のうち、一次電池はどれ。',
    a: '乾電池',
    b: 'リチウムイオン電池',
    c: '鉛蓄電池',
    d: 'ニッケル水素電池',
    explanation: 'この問題の解説\n使い捨ての電池を『一次電池』、充電して繰り返し使える電池を『二次電池』といいます。',
  },
  {
    check: 'G3_ryuge_SI',
    question: 'ある濃度のうすい塩酸15cm³に、ある濃度のうすい水酸化ナトリウム水溶液10cm³を加えると、過不足なく反応し中性となった。この塩酸が10cm3あるとき、水酸化ナトリウム水溶液は何cm3で中性になるか。',
    a: '6cm³',
    b: '8cm³',
    c: '10cm³',
    d: '12cm³',
    explanation: 'この問題の解説\n塩酸と水酸化ナトリウムの反応比は3：2です。比例計算を使って解きましょう。',
  },
  {
    check: 'G3_ryuge_SI',
    question: '天体が、中心を通る軸を中心に自ら回転することを何というか。',
    a: '自転',
    b: '周回',
    c: '回転',
    d: '公転',
    explanation: 'この問題の解説\n地球は地軸を中心として自転します。',
  },
  {
    check: 'G3_ryuge_SI',
    question: '地球の自転の向きは、次のうちどの方位からどの方位か。',
    a: '西から東',
    b: '南から北',
    c: '東から西',
    d: '北から南',
    explanation: '',
  },
  {
    check: 'G3_ryuge_SI',
    question: '天体は、東から西へ１日に１回転するように見える。このような天体の見かけの運動を何というか。',
    a: '日周運動',
    b: '年周運動',
    c: '見かけ運動',
    d: '天体運動',
    explanation: '',
  },
  {
    check: 'G3_ryuge_SI',
    question: '日周運動では、天体は一時間あたりに約何°の割合で動いているように見えるか。',
    a: '15°',
    b: '30°',
    c: '45°',
    d: '60°',
    explanation: 'この問題の解説\n日周運動において、天体は24時間で360°動いているように見えます。。',
  },
  {
    check: 'G3_ryuge_SI',
    question: '観測地から見て、太陽が真南にくることを何というか。',
    a: '南中',
    b: '天球',
    c: '天頂',
    d: '南中時刻',
    explanation: '',
    correct: 'c'
  },
  {
    check: 'G3_ryuge_SI',
    question: '天体がほかの天体のまわりを回転することを何というか。',
    a: '公転',
    b: '周回',
    c: '自転',
    d: '回転',
    explanation: 'この問題の解説\n地球は太陽を中心として、その周りを公転します。',
  },
  {
    check: 'G3_ryuge_SI',
    question: '地球は太陽のまわりを一年で何°回転するか。',
    a: '360°',
    b: '15°',
    c: '30°',
    d: '1°',
    explanation: 'この問題の解説\n地球は太陽のまわりを一年間で１周します。。',
  },
  {
    check: 'G3_ryuge_SI',
    question: '年周運動における、１年間の太陽の通り道を何というか。',
    a: '黄道',
    b: '赤道',
    c: '太道',
    d: '陽道',
    explanation: '',
  },
  {
    check: 'G3_ryuge_SI',
    question: '一年のうちで、日の出・日の入りが最も北よりになるのはいつか。',
    a: '夏至の日',
    b: '春分の日',
    c: '秋分の日',
    d: '冬至の日',
    explanation: 'この問題の解説\n夏至の日は、北半球において、一年の中で最も昼の長さが長くなり、南中高度も高くなります。',
  },
  {
    check: 'G3_ryuge_SI',
    question: '一年のうち、地軸の北側が太陽と反対側を向いているのはいつか。',
    a: '冬至の日',
    b: '夏至の日',
    c: '秋分の日',
    d: '春分の日',
    explanation: 'この問題の解説\n冬至の日は、北半球において、一年の中で最も昼の長さが短くなり、南中高度も低くなります。',
  },
  // 中３ 龍華 社会

  //// 中３ 大正

  // 中３ 大正 英語

  // 中３ 大正 数学

  // 中３ 大正 理科

  // 中３ 大正 社会

  //// 中３ 曙南

  // 中３ 曙南 英語

  // 中３ 曙南 数学

  // 中３ 曙南 理科

  // 中３ 曙南 社会

  //// 中３ 長六

  // 中３ 長六 英語

  // 中３ 長六 数学

  // 中３ 長六 理科

  // 中３ 長六 社会



];

export { quizDataJp }