const quizDataJp = [
  // {
  //   check: 'G1_kamei',
  //   question: 'この問題の答えはなんでしょう',
  //   a: 'Take My Hand',
  //   b: 'When The Sun Goes Down',
  //   c: 'Song 2',
  //   d: 'Rewind',
  //   explanation: 'この問題の答えはCです',
  // },


  ////// 中１
  //// 中１ 亀井
  // 中１ 亀井 英語
  // 中１ 亀井 数学
  // 中１ 亀井 理科
  {
    check: 'G1_kamei_SI',
    question: '次のうち自ら動き回る生物はどれか。',
    a: 'アメーバ',
    b: 'ミカヅキモ',
    c: 'アオミドロ',
    d: 'ボルボックス',
    explanation: 'アメーバ以外の生物は日光の力をかりて、自ら養分をつくる「光合成」というはたらきをします。',
  },
  {
    check: 'G1_kamei_SI',
    question: 'ルーペを使うとき、見てはいけないものは何か。',
    a: '太陽',
    b: '人',
    c: '虫',
    d: '動物',
    explanation: '',
  },
  {
    check: 'G1_kamei_SI',
    question: '顕微鏡を使うとき、最初に取り付けるものは何か。',
    a: '接眼レンズ',
    b: '対物レンズ',
    c: 'レボルバー',
    d: '反射鏡',
    explanation: '',
  },
  {
    check: 'G1_kamei_SI',
    question: '顕微鏡で観察したとき、観察したいものが左下に見えた。視野の中央に移動させるには、プレパラートをどの方向に動かせばよいか。',
    a: '左下',
    b: '右下',
    c: '左上',
    d: '右上',
    explanation: '顕微鏡では左右上下逆に見えます。',
  },
  {
    check: 'G1_kamei_SI',
    question: '顕微鏡で観察をするとき、レンズを付けた後にすることは何か。',
    a: '反射鏡としぼりで視野の明るさを調整する。',
    b: '対物レンズとプレパラートの距離をできるだけ近づける。',
    c: 'レボルバーを回し、高倍率の対物レンズにする。',
    d: '調節ねじでピントを合わせる',
    explanation: '',
  },
  {
    check: 'G1_kamei_SI',
    question: 'めしべの先端の部分を何というか。',
    a: '柱頭',
    b: 'やく',
    c: 'がく',
    d: '子房',
    explanation: '',
  },
  {
    check: 'G1_kamei_SI',
    question: 'おしべの先端にあるやくには何が入っているか。',
    a: '花粉',
    b: '胚珠',
    c: '種子',
    d: '子房',
    explanation: '',
  },
  {
    check: 'G1_kamei_SI',
    question: '20～40倍程度に拡大でき、物体を立体的にみることができる顕微鏡を何というか。',
    a: '双眼実体顕微鏡',
    b: '金属顕微鏡',
    c: '生物顕微鏡',
    d: 'デジタル顕微鏡',
    explanation: '双眼実体顕微鏡は物体の向きはそのままで、立体的にみることができます。',
  },
  {
    check: 'G1_kamei_SI',
    question: '10倍の接眼レンズと15倍の対物レンズを使った場合、観察する倍率は何倍になるか。',
    a: '150倍',
    b: '75倍',
    c: '25倍',
    d: '12.5倍',
    explanation: '観察倍率はそれぞれのレンズの倍率をかけたものになります。',
  },
  {
    check: 'G1_kamei_SI',
    question: 'スケッチをするときの注意点として正しくないものはどれか。',
    a: 'わかりやすいように色を塗る',
    b: '二度書きしない',
    c: '影はつけない',
    d: 'わかりやいように細い線で描く',
    explanation: '',
  },
  // 中１ 亀井 社会

  //// 中１ 龍華
  // 中１ 龍華 英語
  // 中１ 龍華 数学
  // 中１ 龍華 理科
  {
    check: 'G1_ryuge_SI',
    question: '次のうち自ら動き回る生物はどれか。',
    a: 'アメーバ',
    b: 'ミカヅキモ',
    c: 'アオミドロ',
    d: 'ボルボックス',
    explanation: 'アメーバ以外の生物は日光の力をかりて、自ら養分をつくる「光合成」というはたらきをします。',
  },
  {
    check: 'G1_ryuge_SI',
    question: 'ルーペを使うとき、見てはいけないものは何か。',
    a: '太陽',
    b: '人',
    c: '虫',
    d: '動物',
    explanation: '',
  },
  {
    check: 'G1_ryuge_SI',
    question: '顕微鏡を使うとき、最初に取り付けるものは何か。',
    a: '接眼レンズ',
    b: '対物レンズ',
    c: 'レボルバー',
    d: '反射鏡',
    explanation: '',
  },
  {
    check: 'G1_ryuge_SI',
    question: '顕微鏡で観察したとき、観察したいものが左下に見えた。視野の中央に移動させるには、プレパラートをどの方向に動かせばよいか。',
    a: '左下',
    b: '右下',
    c: '左上',
    d: '右上',
    explanation: '顕微鏡では左右上下逆に見えます。',
  },
  {
    check: 'G1_ryuge_SI',
    question: '顕微鏡で観察をするとき、レンズを付けた後にすることは何か。',
    a: '反射鏡としぼりで視野の明るさを調整する。',
    b: '対物レンズとプレパラートの距離をできるだけ近づける。',
    c: 'レボルバーを回し、高倍率の対物レンズにする。',
    d: '調節ねじでピントを合わせる',
    explanation: '',
  },
  {
    check: 'G1_ryuge_SI',
    question: 'めしべの先端の部分を何というか。',
    a: '柱頭',
    b: 'やく',
    c: 'がく',
    d: '子房',
    explanation: '',
  },
  {
    check: 'G1_ryuge_SI',
    question: 'おしべの先端にあるやくには何が入っているか。',
    a: '花粉',
    b: '胚珠',
    c: '種子',
    d: '子房',
    explanation: '',
  },
  {
    check: 'G1_ryuge_SI',
    question: '20～40倍程度に拡大でき、物体を立体的にみることができる顕微鏡を何というか。',
    a: '双眼実体顕微鏡',
    b: '金属顕微鏡',
    c: '生物顕微鏡',
    d: 'デジタル顕微鏡',
    explanation: '双眼実体顕微鏡は物体の向きはそのままで、立体的にみることができます。',
  },
  {
    check: 'G1_ryuge_SI',
    question: '10倍の接眼レンズと15倍の対物レンズを使った場合、観察する倍率は何倍になるか。',
    a: '150倍',
    b: '75倍',
    c: '25倍',
    d: '12.5倍',
    explanation: '観察倍率はそれぞれのレンズの倍率をかけたものになります。',
  },
  {
    check: 'G1_ryuge_SI',
    question: 'スケッチをするときの注意点として正しくないものはどれか。',
    a: 'わかりやすいように色を塗る',
    b: '二度書きしない',
    c: '影はつけない',
    d: 'わかりやいように細い線で描く',
    explanation: '',
  },

  // 中１ 龍華 社会

  //// 中１ 大正
  // 中１ 大正 英語
  // 中１ 大正 数学
  // 中１ 大正 理科
  {
    check: 'G1_taisho_SI',
    question: '次のうち自ら動き回る生物はどれか。',
    a: 'アメーバ',
    b: 'ミカヅキモ',
    c: 'アオミドロ',
    d: 'ボルボックス',
    explanation: 'アメーバ以外の生物は日光の力をかりて、自ら養分をつくる「光合成」というはたらきをします。',
  },
  {
    check: 'G1_taisho_SI',
    question: 'ルーペを使うとき、見てはいけないものは何か。',
    a: '太陽',
    b: '人',
    c: '虫',
    d: '動物',
    explanation: '',
  },
  {
    check: 'G1_taisho_SI',
    question: '顕微鏡を使うとき、最初に取り付けるものは何か。',
    a: '接眼レンズ',
    b: '対物レンズ',
    c: 'レボルバー',
    d: '反射鏡',
    explanation: '',
  },
  {
    check: 'G1_taisho_SI',
    question: '顕微鏡で観察したとき、観察したいものが左下に見えた。視野の中央に移動させるには、プレパラートをどの方向に動かせばよいか。',
    a: '左下',
    b: '右下',
    c: '左上',
    d: '右上',
    explanation: '顕微鏡では左右上下逆に見えます。',
  },
  {
    check: 'G1_taisho_SI',
    question: '顕微鏡で観察をするとき、レンズを付けた後にすることは何か。',
    a: '反射鏡としぼりで視野の明るさを調整する。',
    b: '対物レンズとプレパラートの距離をできるだけ近づける。',
    c: 'レボルバーを回し、高倍率の対物レンズにする。',
    d: '調節ねじでピントを合わせる',
    explanation: '',
  },
  {
    check: 'G1_taisho_SI',
    question: 'めしべの先端の部分を何というか。',
    a: '柱頭',
    b: 'やく',
    c: 'がく',
    d: '子房',
    explanation: '',
  },
  {
    check: 'G1_taisho_SI',
    question: 'おしべの先端にあるやくには何が入っているか。',
    a: '花粉',
    b: '胚珠',
    c: '種子',
    d: '子房',
    explanation: '',
  },
  {
    check: 'G1_taisho_SI',
    question: '20～40倍程度に拡大でき、物体を立体的にみることができる顕微鏡を何というか。',
    a: '双眼実体顕微鏡',
    b: '金属顕微鏡',
    c: '生物顕微鏡',
    d: 'デジタル顕微鏡',
    explanation: '双眼実体顕微鏡は物体の向きはそのままで、立体的にみることができます。',
  },
  {
    check: 'G1_taisho_SI',
    question: '10倍の接眼レンズと15倍の対物レンズを使った場合、観察する倍率は何倍になるか。',
    a: '150倍',
    b: '75倍',
    c: '25倍',
    d: '12.5倍',
    explanation: '観察倍率はそれぞれのレンズの倍率をかけたものになります。',
  },
  {
    check: 'G1_taisho_SI',
    question: 'スケッチをするときの注意点として正しくないものはどれか。',
    a: 'わかりやすいように色を塗る',
    b: '二度書きしない',
    c: '影はつけない',
    d: 'わかりやいように細い線で描く',
    explanation: '',
  },

  // 中１ 大正 社会

  //// 中１ 曙川南
  // 中１ 曙川南 英語
  // 中１ 曙川南 数学
  // 中１ 曙川南 理科
  {
    check: 'G1_akenan_SI',
    question: '次のうち自ら動き回る生物はどれか。',
    a: 'アメーバ',
    b: 'ミカヅキモ',
    c: 'アオミドロ',
    d: 'ボルボックス',
    explanation: 'アメーバ以外の生物は日光の力をかりて、自ら養分をつくる「光合成」というはたらきをします。',
  },
  {
    check: 'G1_akenan_SI',
    question: 'ルーペを使うとき、見てはいけないものは何か。',
    a: '太陽',
    b: '人',
    c: '虫',
    d: '動物',
    explanation: '',
  },
  {
    check: 'G1_akenan_SI',
    question: '顕微鏡を使うとき、最初に取り付けるものは何か。',
    a: '接眼レンズ',
    b: '対物レンズ',
    c: 'レボルバー',
    d: '反射鏡',
    explanation: '',
  },
  {
    check: 'G1_akenan_SI',
    question: '顕微鏡で観察したとき、観察したいものが左下に見えた。視野の中央に移動させるには、プレパラートをどの方向に動かせばよいか。',
    a: '左下',
    b: '右下',
    c: '左上',
    d: '右上',
    explanation: '顕微鏡では左右上下逆に見えます。',
  },
  {
    check: 'G1_akenan_SI',
    question: '顕微鏡で観察をするとき、レンズを付けた後にすることは何か。',
    a: '反射鏡としぼりで視野の明るさを調整する。',
    b: '対物レンズとプレパラートの距離をできるだけ近づける。',
    c: 'レボルバーを回し、高倍率の対物レンズにする。',
    d: '調節ねじでピントを合わせる',
    explanation: '',
  },
  {
    check: 'G1_akenan_SI',
    question: 'めしべの先端の部分を何というか。',
    a: '柱頭',
    b: 'やく',
    c: 'がく',
    d: '子房',
    explanation: '',
  },
  {
    check: 'G1_akenan_SI',
    question: 'おしべの先端にあるやくには何が入っているか。',
    a: '花粉',
    b: '胚珠',
    c: '種子',
    d: '子房',
    explanation: '',
  },
  {
    check: 'G1_akenan_SI',
    question: '20～40倍程度に拡大でき、物体を立体的にみることができる顕微鏡を何というか。',
    a: '双眼実体顕微鏡',
    b: '金属顕微鏡',
    c: '生物顕微鏡',
    d: 'デジタル顕微鏡',
    explanation: '双眼実体顕微鏡は物体の向きはそのままで、立体的にみることができます。',
  },
  {
    check: 'G1_akenan_SI',
    question: '10倍の接眼レンズと15倍の対物レンズを使った場合、観察する倍率は何倍になるか。',
    a: '150倍',
    b: '75倍',
    c: '25倍',
    d: '12.5倍',
    explanation: '観察倍率はそれぞれのレンズの倍率をかけたものになります。',
  },
  {
    check: 'G1_akenan_SI',
    question: 'スケッチをするときの注意点として正しくないものはどれか。',
    a: 'わかりやすいように色を塗る',
    b: '二度書きしない',
    c: '影はつけない',
    d: 'わかりやいように細い線で描く',
    explanation: '',
  },

  // 中１ 曙川南 社会

  //// 中１ 南高安
  // 中１ 南高安 英語
  // 中１ 南高安 数学
  // 中１ 南高安 理科
  // 中１ 南高安 社会



  ////// 中２
  //// 中２ 亀井
  // 中２ 亀井 英語
  // 中２ 亀井 数学
  // 中２ 亀井 理科
  // 中２ 亀井 社会

  //// 中２ 龍華
  // 中２ 龍華 英語
  // 中２ 龍華 数学
  // 中２ 龍華 理科
  // 中２ 龍華 社会

  //// 中２ 大正
  // 中２ 大正 英語
  // 中２ 大正 数学
  // 中２ 大正 理科
  // 中２ 大正 社会

  //// 中２ 曙川南
  // 中２ 曙川南 英語
  // 中２ 曙川南 数学
  // 中２ 曙川南 理科
  // 中２ 曙川南 社会

  //// 中２ 南高安
  // 中２ 南高安 英語
  // 中２ 南高安 数学
  // 中２ 南高安 理科
  // 中２ 南高安 社会

  ////// 中３
  //// 中３ 亀井
  // 中３ 亀井 英語
  // 中３ 亀井 数学
  // 中３ 亀井 理科
  // 中３ 亀井 社会

  //// 中３ 龍華
  // 中３ 龍華 英語
  // 中３ 龍華 数学
  // 中３ 龍華 理科
  // 中３ 龍華 社会

  //// 中３ 大正
  // 中３ 大正 英語
  // 中３ 大正 数学
  // 中３ 大正 理科
  // 中３ 大正 社会

  //// 中３ 曙川南
  // 中３ 曙川南 英語
  // 中３ 曙川南 数学
  // 中３ 曙川南 理科
  // 中３ 曙川南 社会

  //// 中３ 南高安
  // 中３ 南高安 英語
  // 中３ 南高安 数学
  // 中３ 南高安 理科
  // 中３ 南高安 社会







];

export { quizDataJp }