const quizDataJp = [
  // {
  //   check: 'G1_kamei',
  //   question: 'この問題の答えはなんでしょう',
  //   a: 'Take My Hand',
  //   b: 'When The Sun Goes Down',
  //   c: 'Song 2',
  //   d: 'Rewind',
  //   explanation: 'この問題の答えはCです',
  // },


  ////// 中１
  //// 中１ 亀井
  // 中１ 亀井 英語
  // 中１ 亀井 数学
  // 中１ 亀井 理科
  {
    check: 'G1_kamei_SI',
    question: '次のうち自ら動き回る生物はどれか。',
    a: 'アメーバ',
    b: 'ミカヅキモ',
    c: 'アオミドロ',
    d: 'ボルボックス',
    explanation: 'アメーバ以外の生物は日光の力をかりて、自ら養分をつくる「光合成」というはたらきをします。',
  },
  {
    check: 'G1_kamei_SI',
    question: 'ルーペを使うとき、見てはいけないものは何か。',
    a: '太陽',
    b: '人',
    c: '虫',
    d: '動物',
    explanation: '',
  },
  {
    check: 'G1_kamei_SI',
    question: '顕微鏡を使うとき、最初に取り付けるものは何か。',
    a: '接眼レンズ',
    b: '対物レンズ',
    c: 'レボルバー',
    d: '反射鏡',
    explanation: '',
  },
  {
    check: 'G1_kamei_SI',
    question: '顕微鏡で観察したとき、観察したいものが左下に見えた。視野の中央に移動させるには、プレパラートをどの方向に動かせばよいか。',
    a: '左下',
    b: '右下',
    c: '左上',
    d: '右上',
    explanation: '顕微鏡では左右上下逆に見えます。',
  },
  {
    check: 'G1_kamei_SI',
    question: '顕微鏡で観察をするとき、レンズを付けた後にすることは何か。',
    a: '反射鏡としぼりで視野の明るさを調整する。',
    b: '対物レンズとプレパラートの距離をできるだけ近づける。',
    c: 'レボルバーを回し、高倍率の対物レンズにする。',
    d: '調節ねじでピントを合わせる',
    explanation: '',
  },
  {
    check: 'G1_kamei_SI',
    question: 'めしべの先端の部分を何というか。',
    a: '柱頭',
    b: 'やく',
    c: 'がく',
    d: '子房',
    explanation: '',
  },
  {
    check: 'G1_kamei_SI',
    question: 'おしべの先端にあるやくには何が入っているか。',
    a: '花粉',
    b: '胚珠',
    c: '種子',
    d: '子房',
    explanation: '',
  },
  {
    check: 'G1_kamei_SI',
    question: '20～40倍程度に拡大でき、物体を立体的にみることができる顕微鏡を何というか。',
    a: '双眼実体顕微鏡',
    b: '金属顕微鏡',
    c: '生物顕微鏡',
    d: 'デジタル顕微鏡',
    explanation: '双眼実体顕微鏡は物体の向きはそのままで、立体的にみることができます。',
  },
  {
    check: 'G1_kamei_SI',
    question: '10倍の接眼レンズと15倍の対物レンズを使った場合、観察する倍率は何倍になるか。',
    a: '150倍',
    b: '75倍',
    c: '25倍',
    d: '12.5倍',
    explanation: '観察倍率はそれぞれのレンズの倍率をかけたものになります。',
  },
  {
    check: 'G1_kamei_SI',
    question: 'スケッチをするときの注意点として正しくないものはどれか。',
    a: 'わかりやすいように色を塗る',
    b: '二度書きしない',
    c: '影はつけない',
    d: 'わかりやいように細い線で描く',
    explanation: '',
  },
  // 中１ 亀井 社会

  //// 中１ 龍華
  // 中１ 龍華 英語
  // 中１ 龍華 数学
  // 中１ 龍華 理科
  {
    check: 'G1_ryuge_SI',
    question: '次のうち自ら動き回る生物はどれか。',
    a: 'アメーバ',
    b: 'ミカヅキモ',
    c: 'アオミドロ',
    d: 'ボルボックス',
    explanation: 'アメーバ以外の生物は日光の力をかりて、自ら養分をつくる「光合成」というはたらきをします。',
  },
  {
    check: 'G1_ryuge_SI',
    question: 'ルーペを使うとき、見てはいけないものは何か。',
    a: '太陽',
    b: '人',
    c: '虫',
    d: '動物',
    explanation: '',
  },
  {
    check: 'G1_ryuge_SI',
    question: '顕微鏡を使うとき、最初に取り付けるものは何か。',
    a: '接眼レンズ',
    b: '対物レンズ',
    c: 'レボルバー',
    d: '反射鏡',
    explanation: '',
  },
  {
    check: 'G1_ryuge_SI',
    question: '顕微鏡で観察したとき、観察したいものが左下に見えた。視野の中央に移動させるには、プレパラートをどの方向に動かせばよいか。',
    a: '左下',
    b: '右下',
    c: '左上',
    d: '右上',
    explanation: '顕微鏡では左右上下逆に見えます。',
  },
  {
    check: 'G1_ryuge_SI',
    question: '顕微鏡で観察をするとき、レンズを付けた後にすることは何か。',
    a: '反射鏡としぼりで視野の明るさを調整する。',
    b: '対物レンズとプレパラートの距離をできるだけ近づける。',
    c: 'レボルバーを回し、高倍率の対物レンズにする。',
    d: '調節ねじでピントを合わせる',
    explanation: '',
  },
  {
    check: 'G1_ryuge_SI',
    question: 'めしべの先端の部分を何というか。',
    a: '柱頭',
    b: 'やく',
    c: 'がく',
    d: '子房',
    explanation: '',
  },
  {
    check: 'G1_ryuge_SI',
    question: 'おしべの先端にあるやくには何が入っているか。',
    a: '花粉',
    b: '胚珠',
    c: '種子',
    d: '子房',
    explanation: '',
  },
  {
    check: 'G1_ryuge_SI',
    question: '20～40倍程度に拡大でき、物体を立体的にみることができる顕微鏡を何というか。',
    a: '双眼実体顕微鏡',
    b: '金属顕微鏡',
    c: '生物顕微鏡',
    d: 'デジタル顕微鏡',
    explanation: '双眼実体顕微鏡は物体の向きはそのままで、立体的にみることができます。',
  },
  {
    check: 'G1_ryuge_SI',
    question: '10倍の接眼レンズと15倍の対物レンズを使った場合、観察する倍率は何倍になるか。',
    a: '150倍',
    b: '75倍',
    c: '25倍',
    d: '12.5倍',
    explanation: '観察倍率はそれぞれのレンズの倍率をかけたものになります。',
  },
  {
    check: 'G1_ryuge_SI',
    question: 'スケッチをするときの注意点として正しくないものはどれか。',
    a: 'わかりやすいように色を塗る',
    b: '二度書きしない',
    c: '影はつけない',
    d: 'わかりやいように細い線で描く',
    explanation: '',
  },

  // 中１ 龍華 社会

  //// 中１ 大正
  // 中１ 大正 英語
  // 中１ 大正 数学
  // 中１ 大正 理科
  {
    check: 'G1_taisho_SI',
    question: '次のうち自ら動き回る生物はどれか。',
    a: 'アメーバ',
    b: 'ミカヅキモ',
    c: 'アオミドロ',
    d: 'ボルボックス',
    explanation: 'アメーバ以外の生物は日光の力をかりて、自ら養分をつくる「光合成」というはたらきをします。',
  },
  {
    check: 'G1_taisho_SI',
    question: 'ルーペを使うとき、見てはいけないものは何か。',
    a: '太陽',
    b: '人',
    c: '虫',
    d: '動物',
    explanation: '',
  },
  {
    check: 'G1_taisho_SI',
    question: '顕微鏡を使うとき、最初に取り付けるものは何か。',
    a: '接眼レンズ',
    b: '対物レンズ',
    c: 'レボルバー',
    d: '反射鏡',
    explanation: '',
  },
  {
    check: 'G1_taisho_SI',
    question: '顕微鏡で観察したとき、観察したいものが左下に見えた。視野の中央に移動させるには、プレパラートをどの方向に動かせばよいか。',
    a: '左下',
    b: '右下',
    c: '左上',
    d: '右上',
    explanation: '顕微鏡では左右上下逆に見えます。',
  },
  {
    check: 'G1_taisho_SI',
    question: '顕微鏡で観察をするとき、レンズを付けた後にすることは何か。',
    a: '反射鏡としぼりで視野の明るさを調整する。',
    b: '対物レンズとプレパラートの距離をできるだけ近づける。',
    c: 'レボルバーを回し、高倍率の対物レンズにする。',
    d: '調節ねじでピントを合わせる',
    explanation: '',
  },
  {
    check: 'G1_taisho_SI',
    question: 'めしべの先端の部分を何というか。',
    a: '柱頭',
    b: 'やく',
    c: 'がく',
    d: '子房',
    explanation: '',
  },
  {
    check: 'G1_taisho_SI',
    question: 'おしべの先端にあるやくには何が入っているか。',
    a: '花粉',
    b: '胚珠',
    c: '種子',
    d: '子房',
    explanation: '',
  },
  {
    check: 'G1_taisho_SI',
    question: '20～40倍程度に拡大でき、物体を立体的にみることができる顕微鏡を何というか。',
    a: '双眼実体顕微鏡',
    b: '金属顕微鏡',
    c: '生物顕微鏡',
    d: 'デジタル顕微鏡',
    explanation: '双眼実体顕微鏡は物体の向きはそのままで、立体的にみることができます。',
  },
  {
    check: 'G1_taisho_SI',
    question: '10倍の接眼レンズと15倍の対物レンズを使った場合、観察する倍率は何倍になるか。',
    a: '150倍',
    b: '75倍',
    c: '25倍',
    d: '12.5倍',
    explanation: '観察倍率はそれぞれのレンズの倍率をかけたものになります。',
  },
  {
    check: 'G1_taisho_SI',
    question: 'スケッチをするときの注意点として正しくないものはどれか。',
    a: 'わかりやすいように色を塗る',
    b: '二度書きしない',
    c: '影はつけない',
    d: 'わかりやいように細い線で描く',
    explanation: '',
  },

  // 中１ 大正 社会

  //// 中１ 曙川南
  // 中１ 曙川南 英語
  // 中１ 曙川南 数学
  // 中１ 曙川南 理科
  {
    check: 'G1_akenan_SI',
    question: '次のうち自ら動き回る生物はどれか。',
    a: 'アメーバ',
    b: 'ミカヅキモ',
    c: 'アオミドロ',
    d: 'ボルボックス',
    explanation: 'アメーバ以外の生物は日光の力をかりて、自ら養分をつくる「光合成」というはたらきをします。',
  },
  {
    check: 'G1_akenan_SI',
    question: 'ルーペを使うとき、見てはいけないものは何か。',
    a: '太陽',
    b: '人',
    c: '虫',
    d: '動物',
    explanation: '',
  },
  {
    check: 'G1_akenan_SI',
    question: '顕微鏡を使うとき、最初に取り付けるものは何か。',
    a: '接眼レンズ',
    b: '対物レンズ',
    c: 'レボルバー',
    d: '反射鏡',
    explanation: '',
  },
  {
    check: 'G1_akenan_SI',
    question: '顕微鏡で観察したとき、観察したいものが左下に見えた。視野の中央に移動させるには、プレパラートをどの方向に動かせばよいか。',
    a: '左下',
    b: '右下',
    c: '左上',
    d: '右上',
    explanation: '顕微鏡では左右上下逆に見えます。',
  },
  {
    check: 'G1_akenan_SI',
    question: '顕微鏡で観察をするとき、レンズを付けた後にすることは何か。',
    a: '反射鏡としぼりで視野の明るさを調整する。',
    b: '対物レンズとプレパラートの距離をできるだけ近づける。',
    c: 'レボルバーを回し、高倍率の対物レンズにする。',
    d: '調節ねじでピントを合わせる',
    explanation: '',
  },
  {
    check: 'G1_akenan_SI',
    question: 'めしべの先端の部分を何というか。',
    a: '柱頭',
    b: 'やく',
    c: 'がく',
    d: '子房',
    explanation: '',
  },
  {
    check: 'G1_akenan_SI',
    question: 'おしべの先端にあるやくには何が入っているか。',
    a: '花粉',
    b: '胚珠',
    c: '種子',
    d: '子房',
    explanation: '',
  },
  {
    check: 'G1_akenan_SI',
    question: '20～40倍程度に拡大でき、物体を立体的にみることができる顕微鏡を何というか。',
    a: '双眼実体顕微鏡',
    b: '金属顕微鏡',
    c: '生物顕微鏡',
    d: 'デジタル顕微鏡',
    explanation: '双眼実体顕微鏡は物体の向きはそのままで、立体的にみることができます。',
  },
  {
    check: 'G1_akenan_SI',
    question: '10倍の接眼レンズと15倍の対物レンズを使った場合、観察する倍率は何倍になるか。',
    a: '150倍',
    b: '75倍',
    c: '25倍',
    d: '12.5倍',
    explanation: '観察倍率はそれぞれのレンズの倍率をかけたものになります。',
  },
  {
    check: 'G1_akenan_SI',
    question: 'スケッチをするときの注意点として正しくないものはどれか。',
    a: 'わかりやすいように色を塗る',
    b: '二度書きしない',
    c: '影はつけない',
    d: 'わかりやいように細い線で描く',
    explanation: '',
  },

  // 中１ 曙川南 社会

  //// 中１ 南高安
  // 中１ 南高安 英語
  // 中１ 南高安 数学
  // 中１ 南高安 理科
  // 中１ 南高安 社会



  ////// 中２
  //// 中２ 亀井
  // 中２ 亀井 英語
  // 中２ 亀井 数学
  // 中２ 亀井 理科
  {
    check: 'G2_kamei_SI',
    question: '体が多くの細胞で出来ている生物を何といいますか。',
    a: '多細胞生物',
    b: '単細胞生物',
    c: '組織',
    d: '個体',
    explanation: '単細胞生物は１つの細胞が生きるための全てのはたらきをします。',
  },
  {
    check: 'G2_kamei_SI',
    question: '動物の細胞にしか存在しないものとして適切ではないものは次のうちどれか。',
    a: '液胞',
    b: '細胞膜',
    c: '核',
    d: '細胞質',
    explanation: '植物細胞にしか存在しないものとして、液胞(細胞の活動によりできた物質が溶けた液で満たされたもの)・細胞壁(植物のからだを支えたり、守ったりするもの)・葉緑体(光合成をするもの)があります。',
  },
  {
    check: 'G2_kamei_SI',
    question: '根で吸収した水や水に溶けた養分が通る管を何というか。',
    a: '道管',
    b: '師管',
    c: '維管束',
    d: '葉脈',
    explanation: 'ウチの上水道管(茎で内側、葉で上側を通り水が通る道管)で覚えましょう。',
  },
  {
    check: 'G2_kamei_SI',
    question: '維管束が輪のように並ぶ植物は何でしょう。',
    a: '双子葉類',
    b: '単子葉類',
    c: 'シダ植物',
    d: 'コケ植物',
    explanation: '単子葉類は維管束がバラバラに存在します。',
  },
  {
    check: 'G2_kamei_SI',
    question: '光合成に必要なものとして適切ではないものはどれか。',
    a: 'デンプン',
    b: '二酸化炭素',
    c: '水',
    d: '光',
    explanation: '光合成は、二酸化炭素と水を材料とし、光エネルギーをつかって、葉緑体で酸素とデンプンを作り出します。',
  },
  {
    check: 'G2_kamei_SI',
    question: '消化液に含まれる、養分を分解するはたらきのある物質を何というか。',
    a: '消化酵素',
    b: '消化液',
    c: '消化管',
    d: '肺胞',
    explanation: '消化酵素の中には、だ液に含まれるアミラーゼ・胃液に含まれるペプシン、すい液に含まれるリパーゼなどがあります。',
  },
  {
    check: 'G2_kamei_SI',
    question: 'デンプンにはたらく消化液として適当でないものはどれか。',
    a: '胃液',
    b: 'だ液',
    c: 'すい液',
    d: '腸液',
    explanation: '',
  },
  {
    check: 'G2_kamei_SI',
    question: '次のうち消化酵素をもたない消化液はどれか。',
    a: '胆汁',
    b: '腸液',
    c: '胃液',
    d: 'だ液',
    explanation: '胆汁は消化酵素を持ちませんが、脂肪の分解を助けるはたらきをもちます。',
  },
  {
    check: 'G2_kamei_SI',
    question: 'デンプンは分解され、最終的になんという物質になるか。',
    a: 'ブドウ糖',
    b: 'アミノ酸',
    c: '脂肪酸',
    d: 'モノグリセリド',
    explanation: '',
  },
  {
    check: 'G2_kamei_SI',
    question: 'タンパク質は分解され、最終的になんという物質になるか。',
    a: 'アミノ酸',
    b: 'ブドウ糖',
    c: '脂肪酸',
    d: 'モノグリセリド',
    explanation: '',
  },
  {
    check: 'G2_kamei_SI',
    question: '脂肪は小腸に吸収されたあと、何という管に入るか。',
    a: 'リンパ管',
    b: '毛細血管',
    c: '道管',
    d: '師管',
    explanation: 'ブドウ糖とアミノ酸は毛細血管に入ります。',
  },
  {
    check: 'G2_kamei_SI',
    question: '息を吸うときの説明として正しいものはどれか。',
    a: 'ろっ骨が上がり、横隔膜が下がる',
    b: 'ろっ骨が上がり、横隔膜が上がる',
    c: 'ろっ骨が下がり、横隔膜が下がる',
    d: 'ろっ骨が下がり、横隔膜が上がる',
    explanation: '息を吸うときは胸腔を広くし、息を吐くときは胸腔を狭くするために、ろっ骨が下がり、横隔膜が上がります。',
  },
  {
    check: 'G2_kamei_SI',
    question: '血液の成分のうち、酸素の運搬をするものは次のうちどれか。',
    a: '赤血球',
    b: '白血球',
    c: '血小板',
    d: '血しょう',
    explanation: '赤血球は酸素の多いところでは酸素と結合し、酸素の少ないところでは酸素を手放す性質をもちます。',
  },
  {
    check: 'G2_kamei_SI',
    question: '血液の成分のうち、病原体を分解するものは次のうちどれか。',
    a: '白血球',
    b: '赤血球',
    c: '血小板',
    d: '血しょう',
    explanation: '白血球は病原体を食べて殺す性質をもちます。',
  },
  {
    check: 'G2_kamei_SI',
    question: '血液の成分のうち、血をかためるものは次のうちどれか。',
    a: '血小板',
    b: '赤血球',
    c: '白血球',
    d: '血しょう',
    explanation: '血小板は血をかためてかさぶたを作る性質をもちます。',
  },
  {
    check: 'G2_kamei_SI',
    question: '赤血球に含まれるヘモグロビンは何色の色素成分でしょう。',
    a: '赤色',
    b: '黄色',
    c: '無色透明',
    d: '緑色',
    explanation: '',
  },
  // 中２ 亀井 社会

  //// 中２ 龍華
  // 中２ 龍華 英語
  // 中２ 龍華 数学
  // 中２ 龍華 理科
  {
    check: 'G2_ryuge_SI',
    question: '体が多くの細胞で出来ている生物を何といいますか。',
    a: '多細胞生物',
    b: '単細胞生物',
    c: '組織',
    d: '個体',
    explanation: '単細胞生物は１つの細胞が生きるための全てのはたらきをします。',
  },
  {
    check: 'G2_ryuge_SI',
    question: '動物の細胞にしか存在しないものとして適切ではないものは次のうちどれか。',
    a: '液胞',
    b: '細胞膜',
    c: '核',
    d: '細胞質',
    explanation: '植物細胞にしか存在しないものとして、液胞(細胞の活動によりできた物質が溶けた液で満たされたもの)・細胞壁(植物のからだを支えたり、守ったりするもの)・葉緑体(光合成をするもの)があります。',
  },
  {
    check: 'G2_ryuge_SI',
    question: '根で吸収した水や水に溶けた養分が通る管を何というか。',
    a: '道管',
    b: '師管',
    c: '維管束',
    d: '葉脈',
    explanation: 'ウチの上水道管(茎で内側、葉で上側を通り水が通る道管)で覚えましょう。',
  },
  {
    check: 'G2_ryuge_SI',
    question: '維管束が輪のように並ぶ植物は何でしょう。',
    a: '双子葉類',
    b: '単子葉類',
    c: 'シダ植物',
    d: 'コケ植物',
    explanation: '単子葉類は維管束がバラバラに存在します。',
  },
  {
    check: 'G2_ryuge_SI',
    question: '光合成に必要なものとして適切ではないものはどれか。',
    a: 'デンプン',
    b: '二酸化炭素',
    c: '水',
    d: '光',
    explanation: '光合成は、二酸化炭素と水を材料とし、光エネルギーをつかって、葉緑体で酸素とデンプンを作り出します。',
  },
  {
    check: 'G2_ryuge_SI',
    question: '消化液に含まれる、養分を分解するはたらきのある物質を何というか。',
    a: '消化酵素',
    b: '消化液',
    c: '消化管',
    d: '肺胞',
    explanation: '消化酵素の中には、だ液に含まれるアミラーゼ・胃液に含まれるペプシン、すい液に含まれるリパーゼなどがあります。',
  },
  {
    check: 'G2_ryuge_SI',
    question: 'デンプンにはたらく消化液として適当でないものはどれか。',
    a: '胃液',
    b: 'だ液',
    c: 'すい液',
    d: '腸液',
    explanation: '',
  },
  {
    check: 'G2_ryuge_SI',
    question: '次のうち消化酵素をもたない消化液はどれか。',
    a: '胆汁',
    b: '腸液',
    c: '胃液',
    d: 'だ液',
    explanation: '胆汁は消化酵素を持ちませんが、脂肪の分解を助けるはたらきをもちます。',
  },
  {
    check: 'G2_ryuge_SI',
    question: 'デンプンは分解され、最終的になんという物質になるか。',
    a: 'ブドウ糖',
    b: 'アミノ酸',
    c: '脂肪酸',
    d: 'モノグリセリド',
    explanation: '',
  },
  {
    check: 'G2_ryuge_SI',
    question: 'タンパク質は分解され、最終的になんという物質になるか。',
    a: 'アミノ酸',
    b: 'ブドウ糖',
    c: '脂肪酸',
    d: 'モノグリセリド',
    explanation: '',
  },
  {
    check: 'G2_ryuge_SI',
    question: '脂肪は小腸に吸収されたあと、何という管に入るか。',
    a: 'リンパ管',
    b: '毛細血管',
    c: '道管',
    d: '師管',
    explanation: 'ブドウ糖とアミノ酸は毛細血管に入ります。',
  },
  {
    check: 'G2_ryuge_SI',
    question: '息を吸うときの説明として正しいものはどれか。',
    a: 'ろっ骨が上がり、横隔膜が下がる',
    b: 'ろっ骨が上がり、横隔膜が上がる',
    c: 'ろっ骨が下がり、横隔膜が下がる',
    d: 'ろっ骨が下がり、横隔膜が上がる',
    explanation: '息を吸うときは胸腔を広くし、息を吐くときは胸腔を狭くするために、ろっ骨が下がり、横隔膜が上がります。',
  },
  {
    check: 'G2_ryuge_SI',
    question: '血液の成分のうち、酸素の運搬をするものは次のうちどれか。',
    a: '赤血球',
    b: '白血球',
    c: '血小板',
    d: '血しょう',
    explanation: '赤血球は酸素の多いところでは酸素と結合し、酸素の少ないところでは酸素を手放す性質をもちます。',
  },
  {
    check: 'G2_ryuge_SI',
    question: '血液の成分のうち、病原体を分解するものは次のうちどれか。',
    a: '白血球',
    b: '赤血球',
    c: '血小板',
    d: '血しょう',
    explanation: '白血球は病原体を食べて殺す性質をもちます。',
  },
  {
    check: 'G2_ryuge_SI',
    question: '血液の成分のうち、血をかためるものは次のうちどれか。',
    a: '血小板',
    b: '赤血球',
    c: '白血球',
    d: '血しょう',
    explanation: '血小板は血をかためてかさぶたを作る性質をもちます。',
  },
  {
    check: 'G2_ryuge_SI',
    question: '赤血球に含まれるヘモグロビンは何色の色素成分でしょう。',
    a: '赤色',
    b: '黄色',
    c: '無色透明',
    d: '緑色',
    explanation: '',
  },
  // 中２ 龍華 社会

  //// 中２ 大正
  // 中２ 大正 英語
  // 中２ 大正 数学
  // 中２ 大正 理科
  {
    check: 'G2_taisho_SI',
    question: '体が多くの細胞で出来ている生物を何といいますか。',
    a: '多細胞生物',
    b: '単細胞生物',
    c: '組織',
    d: '個体',
    explanation: '単細胞生物は１つの細胞が生きるための全てのはたらきをします。',
  },
  {
    check: 'G2_taisho_SI',
    question: '動物の細胞にしか存在しないものとして適切ではないものは次のうちどれか。',
    a: '液胞',
    b: '細胞膜',
    c: '核',
    d: '細胞質',
    explanation: '植物細胞にしか存在しないものとして、液胞(細胞の活動によりできた物質が溶けた液で満たされたもの)・細胞壁(植物のからだを支えたり、守ったりするもの)・葉緑体(光合成をするもの)があります。',
  },
  {
    check: 'G2_taisho_SI',
    question: '根で吸収した水や水に溶けた養分が通る管を何というか。',
    a: '道管',
    b: '師管',
    c: '維管束',
    d: '葉脈',
    explanation: 'ウチの上水道管(茎で内側、葉で上側を通り水が通る道管)で覚えましょう。',
  },
  {
    check: 'G2_taisho_SI',
    question: '維管束が輪のように並ぶ植物は何でしょう。',
    a: '双子葉類',
    b: '単子葉類',
    c: 'シダ植物',
    d: 'コケ植物',
    explanation: '単子葉類は維管束がバラバラに存在します。',
  },
  {
    check: 'G2_taisho_SI',
    question: '光合成に必要なものとして適切ではないものはどれか。',
    a: 'デンプン',
    b: '二酸化炭素',
    c: '水',
    d: '光',
    explanation: '光合成は、二酸化炭素と水を材料とし、光エネルギーをつかって、葉緑体で酸素とデンプンを作り出します。',
  },
  {
    check: 'G2_taisho_SI',
    question: '消化液に含まれる、養分を分解するはたらきのある物質を何というか。',
    a: '消化酵素',
    b: '消化液',
    c: '消化管',
    d: '肺胞',
    explanation: '消化酵素の中には、だ液に含まれるアミラーゼ・胃液に含まれるペプシン、すい液に含まれるリパーゼなどがあります。',
  },
  {
    check: 'G2_taisho_SI',
    question: 'デンプンにはたらく消化液として適当でないものはどれか。',
    a: '胃液',
    b: 'だ液',
    c: 'すい液',
    d: '腸液',
    explanation: '',
  },
  {
    check: 'G2_taisho_SI',
    question: '次のうち消化酵素をもたない消化液はどれか。',
    a: '胆汁',
    b: '腸液',
    c: '胃液',
    d: 'だ液',
    explanation: '胆汁は消化酵素を持ちませんが、脂肪の分解を助けるはたらきをもちます。',
  },
  {
    check: 'G2_taisho_SI',
    question: 'デンプンは分解され、最終的になんという物質になるか。',
    a: 'ブドウ糖',
    b: 'アミノ酸',
    c: '脂肪酸',
    d: 'モノグリセリド',
    explanation: '',
  },
  {
    check: 'G2_taisho_SI',
    question: 'タンパク質は分解され、最終的になんという物質になるか。',
    a: 'アミノ酸',
    b: 'ブドウ糖',
    c: '脂肪酸',
    d: 'モノグリセリド',
    explanation: '',
  },
  {
    check: 'G2_taisho_SI',
    question: '脂肪は小腸に吸収されたあと、何という管に入るか。',
    a: 'リンパ管',
    b: '毛細血管',
    c: '道管',
    d: '師管',
    explanation: 'ブドウ糖とアミノ酸は毛細血管に入ります。',
  },
  {
    check: 'G2_taisho_SI',
    question: '息を吸うときの説明として正しいものはどれか。',
    a: 'ろっ骨が上がり、横隔膜が下がる',
    b: 'ろっ骨が上がり、横隔膜が上がる',
    c: 'ろっ骨が下がり、横隔膜が下がる',
    d: 'ろっ骨が下がり、横隔膜が上がる',
    explanation: '息を吸うときは胸腔を広くし、息を吐くときは胸腔を狭くするために、ろっ骨が下がり、横隔膜が上がります。',
  },
  {
    check: 'G2_taisho_SI',
    question: '血液の成分のうち、酸素の運搬をするものは次のうちどれか。',
    a: '赤血球',
    b: '白血球',
    c: '血小板',
    d: '血しょう',
    explanation: '赤血球は酸素の多いところでは酸素と結合し、酸素の少ないところでは酸素を手放す性質をもちます。',
  },
  {
    check: 'G2_taisho_SI',
    question: '血液の成分のうち、病原体を分解するものは次のうちどれか。',
    a: '白血球',
    b: '赤血球',
    c: '血小板',
    d: '血しょう',
    explanation: '白血球は病原体を食べて殺す性質をもちます。',
  },
  {
    check: 'G2_taisho_SI',
    question: '血液の成分のうち、血をかためるものは次のうちどれか。',
    a: '血小板',
    b: '赤血球',
    c: '白血球',
    d: '血しょう',
    explanation: '血小板は血をかためてかさぶたを作る性質をもちます。',
  },
  {
    check: 'G2_taisho_SI',
    question: '赤血球に含まれるヘモグロビンは何色の色素成分でしょう。',
    a: '赤色',
    b: '黄色',
    c: '無色透明',
    d: '緑色',
    explanation: '',
  },
  // 中２ 大正 社会

  //// 中２ 曙川南
  // 中２ 曙川南 英語
  // 中２ 曙川南 数学
  // 中２ 曙川南 理科
  {
    check: 'G2_akenan_SI',
    question: '体が多くの細胞で出来ている生物を何といいますか。',
    a: '多細胞生物',
    b: '単細胞生物',
    c: '組織',
    d: '個体',
    explanation: '単細胞生物は１つの細胞が生きるための全てのはたらきをします。',
  },
  {
    check: 'G2_akenan_SI',
    question: '動物の細胞にしか存在しないものとして適切ではないものは次のうちどれか。',
    a: '液胞',
    b: '細胞膜',
    c: '核',
    d: '細胞質',
    explanation: '植物細胞にしか存在しないものとして、液胞(細胞の活動によりできた物質が溶けた液で満たされたもの)・細胞壁(植物のからだを支えたり、守ったりするもの)・葉緑体(光合成をするもの)があります。',
  },
  {
    check: 'G2_akenan_SI',
    question: '根で吸収した水や水に溶けた養分が通る管を何というか。',
    a: '道管',
    b: '師管',
    c: '維管束',
    d: '葉脈',
    explanation: 'ウチの上水道管(茎で内側、葉で上側を通り水が通る道管)で覚えましょう。',
  },
  {
    check: 'G2_akenan_SI',
    question: '維管束が輪のように並ぶ植物は何でしょう。',
    a: '双子葉類',
    b: '単子葉類',
    c: 'シダ植物',
    d: 'コケ植物',
    explanation: '単子葉類は維管束がバラバラに存在します。',
  },
  {
    check: 'G2_akenan_SI',
    question: '光合成に必要なものとして適切ではないものはどれか。',
    a: 'デンプン',
    b: '二酸化炭素',
    c: '水',
    d: '光',
    explanation: '光合成は、二酸化炭素と水を材料とし、光エネルギーをつかって、葉緑体で酸素とデンプンを作り出します。',
  },
  {
    check: 'G2_akenan_SI',
    question: '消化液に含まれる、養分を分解するはたらきのある物質を何というか。',
    a: '消化酵素',
    b: '消化液',
    c: '消化管',
    d: '肺胞',
    explanation: '消化酵素の中には、だ液に含まれるアミラーゼ・胃液に含まれるペプシン、すい液に含まれるリパーゼなどがあります。',
  },
  {
    check: 'G2_akenan_SI',
    question: 'デンプンにはたらく消化液として適当でないものはどれか。',
    a: '胃液',
    b: 'だ液',
    c: 'すい液',
    d: '腸液',
    explanation: '',
  },
  {
    check: 'G2_akenan_SI',
    question: '次のうち消化酵素をもたない消化液はどれか。',
    a: '胆汁',
    b: '腸液',
    c: '胃液',
    d: 'だ液',
    explanation: '胆汁は消化酵素を持ちませんが、脂肪の分解を助けるはたらきをもちます。',
  },
  {
    check: 'G2_akenan_SI',
    question: 'デンプンは分解され、最終的になんという物質になるか。',
    a: 'ブドウ糖',
    b: 'アミノ酸',
    c: '脂肪酸',
    d: 'モノグリセリド',
    explanation: '',
  },
  {
    check: 'G2_akenan_SI',
    question: 'タンパク質は分解され、最終的になんという物質になるか。',
    a: 'アミノ酸',
    b: 'ブドウ糖',
    c: '脂肪酸',
    d: 'モノグリセリド',
    explanation: '',
  },
  {
    check: 'G2_akenan_SI',
    question: '脂肪は小腸に吸収されたあと、何という管に入るか。',
    a: 'リンパ管',
    b: '毛細血管',
    c: '道管',
    d: '師管',
    explanation: 'ブドウ糖とアミノ酸は毛細血管に入ります。',
  },
  {
    check: 'G2_akenan_SI',
    question: '息を吸うときの説明として正しいものはどれか。',
    a: 'ろっ骨が上がり、横隔膜が下がる',
    b: 'ろっ骨が上がり、横隔膜が上がる',
    c: 'ろっ骨が下がり、横隔膜が下がる',
    d: 'ろっ骨が下がり、横隔膜が上がる',
    explanation: '息を吸うときは胸腔を広くし、息を吐くときは胸腔を狭くするために、ろっ骨が下がり、横隔膜が上がります。',
  },
  {
    check: 'G2_akenan_SI',
    question: '血液の成分のうち、酸素の運搬をするものは次のうちどれか。',
    a: '赤血球',
    b: '白血球',
    c: '血小板',
    d: '血しょう',
    explanation: '赤血球は酸素の多いところでは酸素と結合し、酸素の少ないところでは酸素を手放す性質をもちます。',
  },
  {
    check: 'G2_akenan_SI',
    question: '血液の成分のうち、病原体を分解するものは次のうちどれか。',
    a: '白血球',
    b: '赤血球',
    c: '血小板',
    d: '血しょう',
    explanation: '白血球は病原体を食べて殺す性質をもちます。',
  },
  {
    check: 'G2_akenan_SI',
    question: '血液の成分のうち、血をかためるものは次のうちどれか。',
    a: '血小板',
    b: '赤血球',
    c: '白血球',
    d: '血しょう',
    explanation: '血小板は血をかためてかさぶたを作る性質をもちます。',
  },
  {
    check: 'G2_akenan_SI',
    question: '赤血球に含まれるヘモグロビンは何色の色素成分でしょう。',
    a: '赤色',
    b: '黄色',
    c: '無色透明',
    d: '緑色',
    explanation: '',
  },
  // 中２ 曙川南 社会

  //// 中２ 南高安
  // 中２ 南高安 英語
  // 中２ 南高安 数学
  // 中２ 南高安 理科  
  // 中２ 南高安 社会

  ////// 中３
  //// 中３ 亀井
  // 中３ 亀井 英語
  // 中３ 亀井 数学
  // 中３ 亀井 理科
  // 中３ 亀井 社会

  //// 中３ 龍華
  // 中３ 龍華 英語
  // 中３ 龍華 数学
  // 中３ 龍華 理科
  // 中３ 龍華 社会

  //// 中３ 大正
  // 中３ 大正 英語
  // 中３ 大正 数学
  // 中３ 大正 理科
  // 中３ 大正 社会

  //// 中３ 曙川南
  // 中３ 曙川南 英語
  // 中３ 曙川南 数学
  // 中３ 曙川南 理科
  // 中３ 曙川南 社会

  //// 中３ 南高安
  // 中３ 南高安 英語
  // 中３ 南高安 数学
  // 中３ 南高安 理科
  // 中３ 南高安 社会







];

export { quizDataJp }